InformationRegisters/гф_ПересортицаУдаляемыеШК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_ПересортицаУдаляемыеШК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пересортица</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШтрихкодУпаковки</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/гф_ПересортицаУдаляемыеШК/Ext/RecordSetModule.bsl
&После("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ, Замещение)
	// #wortmann { 
	// Проверка на Уникальность ШК
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eeb9c2a2c92914
	// Галфинд_Домнышева 2024/01/23	
	Для Каждого Запись из ЭтотОбъект Цикл
		
	Если Запись.Обработан Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	гф_ПересортицаУдаляемыеШК.Пересортица КАК Пересортица,
		|	гф_ПересортицаУдаляемыеШК.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ИЗ
		|	РегистрСведений.гф_ПересортицаУдаляемыеШК КАК гф_ПересортицаУдаляемыеШК
		|ГДЕ
		|	гф_ПересортицаУдаляемыеШК.ШтрихкодУпаковки = &ШтрихкодУпаковки
		|	гф_ПересортицаУдаляемыеШК.Пересортица <> &Пересортица";
		
		Запрос.УстановитьПараметр("ШтрихкодУпаковки", Запись.ШтрихкодУпаковки);
		Запрос.УстановитьПараметр("Пересортица", Запись.Пересортица);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Сообщение = "По выбранному КМ " + Выборка.ШтрихкодУпаковки + " уже есть запись по документу " + Выборка.Пересортица;
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
			ЗаписьЖурналаРегистрации("Ошибка", УровеньЖурналаРегистрации.Ошибка, ЭтотОбъект, ЭтотОбъект, Сообщение);

		КонецЦикла;
		  Отказ = Истина;
		КонецЕсли;

	КонецЦикла;
	// } #wortmann
КонецПроцедуры
